app/Controllers/buku.php

    public function simpan()
    {
        if (!$this->validate(
            [
                'judul' => [
                    'rules' => 'required',
                    'errors' => ['required' => '{field} harus di isi']
                ]
            ]
        )) {
            $validation = \Config\Services::validation();
            return redirect()->to('/buku/tambah')->withInput()->with('validation', $validation);
        }
        $this->bukumodel->save(
        [
                'judul' => $this->request->getVar('judul'),
                'pengarang' => $this->request->getVar('pengarang'),
                'sampul' => $this->request->getVar('sampul'),
                'tahun_terbit' => $this->request->getVar('tahun_terbit')
            ]
        );
---
INSERT INTO `buku` (`judul`, `pengarang`, `sampul`, `tahun_terbit`) VALUES ('gamar', 'gamar', 'img6', '2014')